# 아래의 다양한 list comprehension 문제들을 코드로 구현하시오.
# [1] list comprehension 괄호([])를 사용하지 않고 list() 와 for 문으로 1~10까지의 리스트를 만들어보시오.
# [2] 1~10까지의 수를 list comprehension으로 각 숫자를 제곱한 값을 저장하는 리스트를 만들어보시오.
# [3] 위 2번 문제에서 5의 제곱 값은 제외하고 출력시키시오. (★★★)
# [4] if 조건문을 사용하여 1~50까지의 수에서 짝수, 홀수만 저장하는 리스트를 각각 만들어보시오.

[ 출력 결과 ]
-------------------------------------------------------------------------------------------------------------------------------------------
[1] [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
[2] 1~10까지의 수를 제곱한 값   [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
[3] 1~10까지의 수를 제곱한 값에서 5제곱 값은 제외한 리스트   [1, 4, 9, 16, 36, 49, 64, 81, 100]
[4] 1~50까지의 수에서 홀수만 출력   [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49]
