# 리스트 컴프리헨션(list comprehension)이란 무엇인지 예제를 통해 설명해보시오.
# 파이썬에서 굉장히 많이 사용되는 list comprehension 사용법과 개념에 대해서 알고 있는지를 묻는 문제이다.
# 파이썬 외에도 판다스, 넘파이 등 데이터 분석 분야에서도 굉장히 많이 사용되는 문법이므로 중요하다.
# 추가로.. 람다식과 같이 사용하는 방법도 알고 있어야 한다.

[ 출력 결과 ]
-------------------------------------------------------------------------------------------------------------------------------------------
[1] 수동으로 리스트 생성 -->  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] <class 'list'>
[2] 자동으로 리스트 생성 -->  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] <class 'list'>
