# 정수 5개를 원소로 갖는 리스트를 매번 프로그램을 실행할 때 마다 다른 난수로 지정하여 만드시오.
# 이 문제는 random 모듈 사용법을 알고 있는지를 묻는 문제이다.
# [ ! ] : 정수 5개를 랜덤으로 생성하여 리스트로 만들라고?
# [ 잠깐! 고민해보자! ] --> 범위는??? --> 난수 생성을 어느 범위내에서 할 것인지를 고민해봐야 한다. --> range() 사용.
# [ 잠깐! 고민해보자! ] --> 난수 결과를 바로 리스트로 만들라고??? --> 일반적으로는 정수를 반환.


[ 결과 출력 ]
-------------------------------------------------------------------------------------------------------------------------------------------
[2] 랜덤 정수 :  37 <class 'int'>
[3] 랜덤 정수 리스트 :  [5, 3, 2, 8, 6] <class 'list'>
