# 파이썬 프로그래밍 언어에서 변수란 무엇인지 설명해보시오.
# 변수, 상수의 역할은 무엇인지 설명해보시오.

# 변수란? 변하는 수 "변수"
# 코드를 작성하는 과정에서 여러번 반복되는 값을 저장해 두고, 사용할 수 있도록 하는 것 "변수"
# 요리에 비유하면 각종 양념을 담는 양념통 "변수"
# 양념통에는 다양한 양념을 담을 수 있듯이 변수에는 최초의 저장된 값이 다른 값으로 바뀔 수있는 것 (컨테이너) "변수"

# 변수의 역할?
# 양념을 담는 양념통 없이 요리를 하면 번거로움이 발생할 수 있음
# 양념톰 없이 요리를 할 수 있으나, 양념통이 있으면 효율적으로 보다 빨리 요리할 수 있음
# 프로그래밍 코딩시에도 변수를 적절히 사용함으로 코딩을 보다 효율적으로 작성할 수 있음

# 변수 없이도 코드를 작성할수 있지만, 더 효율적으로 코딩을 할 수 있음
# 변수가 있으면 더 많이 빠르게 코드를 작성할 수 있음

# 변수의 존재는 프로그램 코드 작성시 여러 가지 다양한 데이터 값은 효율적으로 저장하고 관리하기 위함 용도로 사용
# 데이터 값을 담는 바구니, 그릇이라 생각


# 파이썬 프로그래밍 언어에서 상수란 무엇인지 설명해보시오.
# 상수란? 항상 변하지 않는 수 "상수"
# 코드를 작성하는 과정에서 오직 하나의 데이터 값을 많이 사용하는데 이런 데이터 값으 담는 바구니 "상수"
# 오직 하나의 데이터 값만 담는 양념통 "상수"
# 상수에는 최초의 저장된 값만 담겨 질 있는 "상수"

# 프로그램의 실행 도중에 데이터 값이 바뀌지 않고 항상 고정된 값 그대로 유지되는 것 "상수"
# 사용자가 임의로 바꾸거나 변경할 수 없는 사전에 미리 정의된 값 "상수"
# 숫자, 문자 등이 있는 "상수"